# TODO: Шаг 1. Импортировать нужные библиотеки (easyocr)
import easyocr
import json

# TODO: Шаг 2. Инициализировать ридер для работы с картинкой


# TODO: Шаг 3. Написать блок выгрузки сырого текста:
# открыть картинку, прогнать через OCR без фильтрации 
# и записать результат построчно в промежуточный .txt файл


# TODO: Шаг 4. Написать функцию нормализации значений:
# принимать строку, проверять наличие точки, 
# если копеек нет — добивать '.00', возвращать нормализованное значение


# TODO: Шаг 5. Написать логику построчного парсинга:
# открыть созданный .txt файл, запустить цикл по строкам, 
# применять функцию нормализации и отбирать нужные данные


# TODO: Шаг 6. Упаковать очищенные и структурированные данные в JSON-файл